EA/src/DataProcessors/ЗагрузкаПриходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаПриходов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьНезависимоОтПризнакаАктивности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Накладные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>id_supplier</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Загружать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фирма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

EA/src/DataProcessors/ЗагрузкаПриходов/Forms/Форма/Module.bsl
&НаСервере
Процедура ЗаполнитьДокументыНаСервере()
	
	ЗаполнитьЗначенияСвойств(Объект,Период);
	ЗначениеОбъект = РеквизитФормыВЗначение("Объект",Тип("ОбработкаОбъект.ЗагрузкаПриходов"));
	ЗначениеОбъект.ЗаполнитьТаблицуНакладные();
	ЗначениеВРеквизитФормы(ЗначениеОбъект,"Объект");
	//---%%% Тарасков - 24.10.2017 - Начало
	//Для каждого строка из Объект.Накладные цикл
	//	Строка.Загружать = Истина;
	//КонецЦикла;
	//---%%% Тарасков - 24.10.2017 - Конец
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДокументы(Команда)
	ЗаполнитьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ДатаНачала = ТекущаяДата();
	Объект.ДатаОкончания = ТекущаяДата();
	ЗаполнитьЗначенияСвойств(Период,Объект);
	//---%%% Тарасков - 19.10.2017 - Начало
	Объект.ЗагружатьНезависимоОтПризнакаАктивности = Ложь;
	//---%%% Тарасков - 19.10.2017 - Конец
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДокументыНаСервере()
	ЗначениеОбъект = РеквизитФормыВЗначение("Объект",Тип("ОбработкаОбъект.ЗагрузкаПриходов"));
	ЗначениеОбъект.ЗагрузитьДокументы();
	ЗначениеВРеквизитФормы(ЗначениеОбъект,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДокументы(Команда)
	ЗагрузитьДокументыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметкиВыполнить(Отметка)
	Для каждого строка из Объект.Накладные цикл
		Строка.Загружать = Отметка;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметки(Команда)
	УстановитьОтметкиВыполнить(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметки(Команда)
	УстановитьОтметкиВыполнить(Ложь);
КонецПроцедуры
